// Users
export const USERS_INFO = JSON.parse(localStorage.getItem("USERS_INFO")) || {
  User123: {
    username: "User123",
    password: "Pass123",
    birthYear: 2001,
    email: "user123@gmail.com",
    img: 8,
    gender: "машко",
    selectedCategories: {
      mostWatched: true,
      popular: true,
      new: true,
      privacy: true,
      danger: true,
    },
  },
  User456: {
    username: "User456",
    password: "Pass456",
    birthYear: 1998,
    email: "user456@gmail.com",
    img: 1,
    gender: "женско",
    selectedCategories: {
      mostWatched: true,
      popular: true,
      new: true,
      privacy: true,
      danger: true,
    },
  },
  User789: {
    username: "User789",
    password: "Pass789",
    birthYear: 1998,
    email: "user789@gmail.com",
    img: 4,
    gender: "женско",
    selectedCategories: {
      mostWatched: true,
      popular: true,
      new: true,
      privacy: true,
      danger: true,
    },
  },
};

// Session Key
export const SESSION_KEY = {
  AUTHENTICATED_USER: "AUTHENTICATED_USER",
};

//categories: "most-watched", "popular", "new", "danger", "privacy"
export const filterCategories = [
  {
    category: "mostWatched",
    title: "Најгледани",
    isActive: true,
  },
  {
    category: "popular",
    title: "Актуелно",
    isActive: true,
  },
  {
    category: "new",
    title: "Најново",
    isActive: true,
  },
  {
    category: "privacy",
    title: "Приватност",
    isActive: true,
  },
  {
    category: "danger",
    title: "Опасност",
    isActive: true,
  },
];

// Supported hash paths
export const supportedPaths = [
  "#home",
  "#profile",
  "#information",
  "#discussion",
  "#login",
  "#contact",
  "404",
];

// Information page cards data
export const infoCards = [
  {
    id: 1,
    title: "Лоши навики при “Live streaming”",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 1,
    category: ["mostWatched", "popular", "privacy"],
  },
  {
    id: 2,
    title: "Праќање на звучни пораки",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 2,
    category: ["new", "popular", "danger"],
  },
  {
    id: 3,
    title: "Безбедност при користење на апликации",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 3,
    category: ["popular", "mostWatched"],
  },
  {
    id: 4,
    title: "Различни уреди, различни проблеми",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 4,
    category: ["danger"],
  },
  {
    id: 5,
    title: "Што се случува во позадина додека сурфаш",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 5,
    category: ["privacy", "new"],
  },
  {
    id: 6,
    title: "Што е важно кога снимаш некој друг",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 6,
    category: ["danger", "new"],
  },
  {
    id: 7,
    title: "Безбедност онлајн и офлајн",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 7,
    category: ["mostWatched", "popular"],
  },
  {
    id: 8,
    title: "Кој може да ја следи твојата активност на интернет?",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 8,
    category: ["mostWatched", "privacy"],
  },
  {
    id: 9,
    title: "Како да (не) го користиш Инстаграм",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 9,
    category: ["mostWatched", "popular", "privacy"],
  },
  {
    id: 10,
    title: "Споделување на содржини",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 10,
    category: ["new", "popular", "danger"],
  },
  {
    id: 11,
    title: "Хакерски напади",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 11,
    category: ["popular", "mostWatched"],
  },
  {
    id: 12,
    title: "Ризици при работење преку интернет",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 12,
    category: ["danger"],
  },
  {
    id: 13,
    title: "На што да внимаваш кога користиш туѓ лаптоп или десктоп компјутер",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 13,
    category: ["privacy", "new"],
  },
  {
    id: 14,
    title: "Компјутерски вируси",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 14,
    category: ["danger", "new"],
  },
  {
    id: 15,
    title: "Целиот свет во твојот екран",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 15,
    category: ["mostWatched", "popular"],
  },
  {
    id: 16,
    title: "Што всушност е интернетот?",
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
    date: "Објавено на 28/05/23",
    img: 16,
    category: ["mostWatched", "privacy"],
  },
];

// Discussion cards data
export const discussionCardsData = JSON.parse(
  localStorage.getItem("DISCUSSION_CARDS")
) || [
  {
    id: "dsCard1",
    img: 1,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
  {
    id: "dsCard2",
    img: 2,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard3",
    img: 3,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard4",
    img: 4,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
  {
    id: "dsCard5",
    img: 5,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
  },
  {
    id: "dsCard6",
    img: 6,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard7",
    img: 7,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
  {
    id: "dsCard8",
    img: 8,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard9",
    img: 9,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard10",
    img: 10,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години.",
  },
  {
    id: "dsCard11",
    img: 1,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет.",
  },
  {
    id: "dsCard12",
    img: 2,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
  {
    id: "dsCard13",
    img: 3,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
  {
    id: "dsCard14",
    img: 4,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard15",
    img: 5,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. ",
  },
  {
    id: "dsCard16",
    img: 6,
    description:
      "Лорем ипсум е едноставен модел на текст кој се користел во печатарската индустрија. Лорем ипсум бил индустриски стандард кој се користел како модел уште пред 1500 години, кога непознат печатар зел кутија со букви и ги сложил на таков начин за да направи примерок на книга. И не само што овој модел опстанал пет векови туку почнал да се користи и во електронските медиуми, кој се уште не е променет. Се популаризирал во 60-тите години на дваесеттиот век со издавањето на збирка од страни во кои се наоѓале Lorem Ipsum пасуси, а денес во софтверскиот пакет како што е Aldus PageMaker во кој се наоѓа верзија на Lorem Ipsum.",
  },
];
